In [1]:
# data set which doesnt has column name

import pandas as pd
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2, 1, 3], index=['c', 'd', 'e'])
s3 = pd.Series([4, 7], index=['a', 'e'])
print(s1)

a    0
b    1
dtype: int64

In [6]:
print(s2)
print(s3)

c    2
d    1
e    3
dtype: int64
a    4
e    7
dtype: int64

In [9]:
# concatenating multiple data sets
print(pd.concat([s1,s2,s3]))

a    0
b    1
c    2
d    1
e    3
a    4
e    7
dtype: int64

In [12]:
# join on axis
print(pd.concat([s2,s3], axis=1))

     0    1
c  2.0  NaN
d  1.0  NaN
e  3.0  7.0
a  NaN  4.0

In [15]:
# DATA TRANSFORMATION
# removing duplicates
# • Removing duplicate entries are quite easy with ‘drop_duplicates’ command. Also, ‘duplicate()’ command
# can be used to check the duplicate entries 

df = pd.DataFrame({'k1':['one']*3 + ['two']*4,'k2':[1,1,2,3,3,4,4]})
print(df)

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [16]:
print(df.duplicated())

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [17]:
print(df.drop_duplicates())

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [18]:
print(df.drop_duplicates('k2'))

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [19]:
# replacing values
df.replace('one', 'ONE')

    k1  k2
0  ONE   1
1  ONE   1
2  ONE   2
3  two   3
4  two   3
5  two   4
6  two   4

In [21]:
df.replace(['One',3],['ONE', 32])

    k1  k2
0  one   1
1  one   1
2  one   2
3  two  32
4  two  32
5  two   4
6  two   4

In [23]:
df.replace({'two':'One', 3:60},{'one': 'ONE', 2:30})

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [26]:
# Using groupby for aggregating functions
df = pd.DataFrame({'k1':['a', 'a', 'b', 'b', 'a'],
'k2':['one', 'two', 'one', 'two', 'one'],
 'data': [2, 3, 3, 2, 4],
'data1': [5, 5, 51, 5, 10]})
print(df)

  k1   k2  data  data1
0  a  one     2      5
1  a  two     3      5
2  b  one     3     51
3  b  two     2      5
4  a  one     4     10

In [27]:
gp = df['data'].groupby(df['k2'])
print(gp.mean())

k2
one    3.0
two    2.5
Name: data, dtype: float64

In [30]:
gp1 = df['data1'].groupby(df['k1'])
print(gp1.mean())

k1
a     6.666667
b    28.000000
Name: data1, dtype: float64

In [32]:
print(gp1.max())

k1
a    10
b    51
Name: data1, dtype: int64

In [33]:
print(gp1.min())

k1
a    5
b    5
Name: data1, dtype: int64

In [34]:
print(gp1.count())

k1
a    3
b    2
Name: data1, dtype: int64

In [35]:
print(gp1.sum())

k1
a    20
b    56
Name: data1, dtype: int64

In [38]:
gp2 = df['data'].groupby([df['k1'], df['k2']])
print(gp2.mean())

k1  k2
a   one    3
    two    3
b   one    3
    two    2
Name: data, dtype: int64

In [39]:
print(gp2.sum())

k1  k2
a   one    6
    two    3
b   one    3
    two    2
Name: data, dtype: int64